YellowCubeService_009/sample_requests/soap_request_GetInsertArticleMasterDataStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:yel="https://service.swisspost.ch/apache/yellowcube/YellowCube_GEN_STATUS_REQUEST_General.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <yel:GEN_STATUS>
         <yel:ControlReference>
            <yel:Type>ART</yel:Type>
            <yel:Sender>YCTest</yel:Sender>
            <yel:Receiver>YELLOWCUBE</yel:Receiver>
            <yel:Timestamp>20141002072741</yel:Timestamp>
            <yel:OperatingMode>T</yel:OperatingMode>
            <yel:Version>1.0</yel:Version>
            <yel:CommType>SOAP</yel:CommType>
         </yel:ControlReference>
         <yel:Reference>70</yel:Reference>
      </yel:GEN_STATUS>
   </soapenv:Body>
</soapenv:Envelope>