YellowCubeService_009/sample_requests/soap_request_GetInventory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:yel="https://service.swisspost.ch/apache/yellowcube/YellowCube_BAR_REQUEST_ArticleList.xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <yel:BAR_Request>
         <yel:ControlReference>
            <yel:Type>BAR</yel:Type>
            <yel:Sender>YCTest</yel:Sender>
            <yel:Receiver>YELLOWCUBE</yel:Receiver>
            <yel:Timestamp>20141002072741</yel:Timestamp>
            <yel:OperatingMode>T</yel:OperatingMode>
            <yel:Version>1.0</yel:Version>
            <!--Optional:-->
            <yel:CommType>SOAP</yel:CommType>
         </yel:ControlReference>
      </yel:BAR_Request>
   </soapenv:Body>
</soapenv:Envelope>