YellowCubeService_009/sample_requests/soap_request_CreateYCCustomerOrder_ohne_PDF.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wab="https://service.swisspost.ch/apache/yellowcube/YellowCube_WAB_REQUEST_Warenausgangsbestellung.xsd">
   <soapenv:Header/>
   <soapenv:Body>
<wab:WAB>
<wab:ControlReference>
<wab:Type>WAB</wab:Type>
<wab:Sender>YCTest</wab:Sender>
<wab:Receiver>YELLOWCUBE</wab:Receiver>
<wab:Timestamp>20141002072741</wab:Timestamp>
<wab:OperatingMode>T</wab:OperatingMode>
<wab:Version>1.0</wab:Version>
<wab:CommType>SOAP</wab:CommType>
<!--Optional:-->
<wab:TransControlID UniqueFlag="1"></wab:TransControlID>
</wab:ControlReference>
<wab:Order>
<wab:OrderHeader>
<wab:DepositorNo>0000040730</wab:DepositorNo>
<!--please use a different CustomerOrderNo for each test-->
<wab:CustomerOrderNo>6000065</wab:CustomerOrderNo>
<wab:CustomerOrderDate>20140914</wab:CustomerOrderDate>
</wab:OrderHeader>
<wab:PartnerAddress>
<wab:Partner>
<wab:PartnerType>WE</wab:PartnerType>
<wab:PartnerNo>0000300020</wab:PartnerNo>
<wab:Title/>
<wab:Name1>We Name</wab:Name1>
<wab:Name2/>
<wab:Name3/>
<wab:Name4/>
<wab:Street>Strasse</wab:Street>
<wab:CountryCode>CH</wab:CountryCode>
<wab:ZIPCode>8057</wab:ZIPCode>
<wab:City>Zurich</wab:City>
<wab:POBox/>
<wab:PhoneNo/>
<wab:SMSAvisMobNo/>
<wab:FaxNo/>
<wab:Email>name@test.ch</wab:Email>
<wab:LanguageCode>en</wab:LanguageCode>
</wab:Partner>
</wab:PartnerAddress>
<wab:ValueAddedServices>
<wab:AdditionalService>
<wab:BasicShippingServices>ECO</wab:BasicShippingServices>
<wab:AdditionalShippingServices/>
<wab:DeliveryInstructions/>
</wab:AdditionalService>
</wab:ValueAddedServices>
<wab:OrderPositions>
<wab:Position>
<wab:PosNo>10</wab:PosNo>
<wab:ArticleNo>200522004</wab:ArticleNo>
<wab:EAN>714718003580</wab:EAN>
<wab:Plant>Y010</wab:Plant>
<wab:Quantity>1.000</wab:Quantity>
<wab:QuantityISO>PCE</wab:QuantityISO>
<wab:ShortDescription>
<![CDATA[Floral Pasty Daisies]]>
</wab:ShortDescription>
</wab:Position>
</wab:OrderPositions>
<wab:OrderDocuments OrderDocumentsFlag="1">             
</wab:OrderDocuments>
</wab:Order>
</wab:WAB>
   </soapenv:Body>
</soapenv:Envelope>